#pragma once

struct CharacterController;
struct DataManager;
struct ArcanaManager;
struct LootManager;
struct WeaponsFacade;
struct LevelUpFactory;
struct Weapon;
struct WeaponData;
struct EnemyData;

//some of these are big as fuck so forward declare them here then put them all the way at the end :nodders:
enum class SfxType;
enum class ItemType;
enum class StageType;
enum class CharacterType;
enum class EnemyType;
enum class EnemySkillType;
enum class WeaponType;
enum class BgmType;
enum class AchievementType;
enum class SecretType;
enum class AdventureAchievementType;
enum class AdventureType;
enum class SkinType;
enum class ArcanaType;
enum class MaterialType;
enum class SpawnType;
enum class CollectionsPageFilterType;
enum class BorderType;
enum class SystemPlatformTypes;
enum class BgmModType;
enum class BgmPlaybackType;
enum class AlbumType;
enum class PowerUpType;
enum class VisibleJoystickType;
enum class ContentGroupType;
enum class PropType;
enum class HitVfxType;
enum class AIType;
enum class PrizeType;
enum class DlcType;
enum class CharacterRandomGeneratorStat;
enum class PickupMode;

struct Il2CppObjectBase
{
    void* klass;
    void* monitor;
};

template<typename T>
struct Nullable
{
    bool hasValue;
private: char pad0[0x3]; public:
    T value;
};
static_assert(sizeof(Nullable<int>) == 8);

struct SoundConfig
{
    Il2CppObjectBase obj;
    bool Mute;
    Nullable<float> Volume;
    float Rate;
    float Detune;
    float Seek;
    bool Loop;
    float Delay;
    float Pan;
};

struct PowerUpLevel
{
    Il2CppObjectBase obj;
    PowerUpType PowerUp;
    int Level;
};
static_assert(offsetof(PowerUpLevel, PowerUp) == 0x10);
static_assert(offsetof(PowerUpLevel, Level) == 0x14);

struct Il2CppString
{
    Il2CppObjectBase obj;
    int length;
    char16_t chars[1];
};
struct Il2CppArrayBounds
{
    uintptr_t length;
    int lower_bound;
};
template<typename T>
struct Il2CppArrayT
{
    Il2CppObjectBase obj;
    Il2CppArrayBounds* bounds;
    uintptr_t max_length;
    T m_Items[1];
};
template<typename T>
struct Il2CppList
{
    Il2CppObjectBase obj;
    Il2CppArrayT<T>* items;
    int size;
    int version;
    void* _syncRoot;
};
template<typename TKey, typename TValue>
struct Il2CppDictionaryEntry
{
    int hashCode;
    int next;
    TKey key;
    TValue value;
};
template<typename TKey, typename TValue>
struct Il2CppDictionary
{
    Il2CppObjectBase obj;
    Il2CppArrayT<int>* buckets;
    Il2CppArrayT<Il2CppDictionaryEntry<TKey, TValue>>* entries;
    int count;
    int version;
    int freeList;
    int freeCount;
    void* comparer;
    void* keys;
    void* values;
    void* _syncRoot;
};
#pragma pack(push, 1)
struct EggFloat
{
    Il2CppObjectBase obj;
    float value;
    float eggValue;
};

struct EggDouble
{
    Il2CppObjectBase obj;
    double value;
    double eggValue;
};
#pragma pack(pop)
static_assert(offsetof(EggFloat, value) == 0x10);
static_assert(offsetof(EggDouble, value) == 0x10);

#pragma pack(push, 1)
struct BaseUIPage
{
private: char pad0[0x98]; public:
    DataManager* Data;                    
private: char pad1[0x8]; public:
    bool isWaitingForPlayersToEnterUi;   
private: char pad2[0x3]; public:
    float defaultRepeatDelay;             
    float defaultInputActionsPerSecond;   
    float maxInputActionsPerSecond;       
    float scrollAccelerationSpeed;        
private: char pad3[0x14]; public:
    Vec3 originalCanvasScale;
    float originalOrthographicSize;       
};
//constexpr int hovertrick = offsetof(BaseUIPage, originalOrthographicSize);
static_assert(offsetof(BaseUIPage, Data) == 0x98);
static_assert(offsetof(BaseUIPage, isWaitingForPlayersToEnterUi) == 0xA8);
static_assert(offsetof(BaseUIPage, defaultRepeatDelay) == 0xAC);
static_assert(offsetof(BaseUIPage, defaultInputActionsPerSecond) == 0xB0);
static_assert(offsetof(BaseUIPage, maxInputActionsPerSecond) == 0xB4);
static_assert(offsetof(BaseUIPage, scrollAccelerationSpeed) == 0xB8);
static_assert(offsetof(BaseUIPage, originalCanvasScale) == 0xD0);
static_assert(offsetof(BaseUIPage, originalOrthographicSize) == 0xDC);

struct CharacterStageData
{
    Il2CppObjectBase obj;
    int complete;
    bool hyperMode;
    bool hurryMode;
    bool inverseMode;
private: char pad1[0x1]; public:
    int survivedMinutes;
    int startedRun;
    StageType type;
};
struct CharacterData
{
private: char pad0[0x28]; public:
    Il2CppString* prefix;
    Il2CppString* charName;
    Il2CppString* surname;
    Il2CppString* textureName;
    Il2CppString* spriteName;
    Il2CppString* charSelTexture;
    Il2CppString* charSelFrame;
    Il2CppString* portraitName;
    int walkingFrames;
};
struct CoopSelections
{
    Il2CppObjectBase obj;
    CharacterType SelectedCharacter;
    ImVec4 Color;
};
struct PlayerOptionsData
{
    Il2CppObjectBase obj;
    Il2CppString* saveDate;
    Il2CppString* platform;
    bool saveSyncPlatformAchievements;
private: char pad1[0x3]; public:
    Nullable<SystemPlatformTypes> saveOriginalPlatform;
private: char pad3[0x4]; public:
    Il2CppList<SystemPlatformTypes>* saveTouchedPlatforms;
    int itemsInCollection;
    int itemsInUnlocks;
    int itemsInSecrets;
    CharacterType selectedCharacter;
    StageType selectedStage;
    bool selectedHyper;
    bool acceptedEULA;
    bool selectedHurry;
    bool selectedMazzo;
    bool selectedLimitBreak;
    bool selectedInverse;
    bool selectedEndless;
    bool selectedGoldenEggs;
    bool selectedSharePassives;
private: char pad4[0x3]; public:
    int selectedArcana;
    bool selectedSurvarots;
    bool forcedSurvarots;
private: char pad5[0x2]; public:
    int inGameFoundSurvarots;
    bool selectedRandomEvents;
    bool selectedRandomLevels;
    bool selectedBGMSave;
private: char pad6[1]; public:
    BgmType selectedBGM;
    BgmModType bgmModType;
    BgmPlaybackType bgmPlaybackType;
private: char pad7[0x4]; public:
    int selectedMaxWeapons;
    bool isFullscreen;
private: char pad8[0x3]; public:
    int version;
    float coins;
    float inGameCoins;
    int kills;
    int bossKills;
private: char pad9[0x4]; public:
    Il2CppList<ItemType>* inGamePickups;
    Il2CppList<WeaponType>* inGameWeapons;
    Il2CppList<CharacterType>* inGameCoffins;
    Il2CppList<EnemyType>* inGameBossesTypes;
    int inGameStarryHeavnes;
    int inGameWeirdSoulsPurifier;
    Il2CppDictionary<EnemyType, int>* runKillCount;
    int runPickupsCoins;
    float lifetimeCoins;
    float totalCoins;
    int beginnersLuck;
    float inGameFever;
    int inGameHunger;
    float rawInGameHeal;
    float lifetimeSurvived;
    float lifetimeHeal;
    float OwO;//???
    int completedHurries;
    float trainHazardEnemiesHit;
    int topLapsCarlo;
    int totalLapsCarlo;
    int topLapsHighway;
    int totalLapsHighway;
    bool reducePhysics;
    bool classicMusic;
    bool visuallyInvertStages;
    bool hideProgress;
    bool soundsEnabled;
    bool musicEnabled;
private: char pad10[0x2]; public:
    float soundsVolume;
    float musicVolume;
    bool flashingVFXEnabled;
private: char pad11[0x3]; public:
    VisibleJoystickType joyStickType;
    bool hideAdsButtons;
    bool damageNumbersEnabled;
    bool glimmerCarouselEnabled;
    bool streamSafeEnabled;
    bool hideXPBar;
    bool cheatCodeUsed;
    bool hasKilledTheFinalBoss;
    bool hasSeenFinalFireworks;
    Il2CppString* language;
    bool showQuitDescription;
    bool hideCompletedAchievements;
private: char pad12[0x2]; public:
    int playedRNJ;
    bool showPickups;
    bool showSmallMapIcons;
private: char pad13[0x2]; public:
    float longestGoldFever;
    float highestGoldFever;
    bool hasUsedMirror;
    bool hasUsedTrumpet;
private: char pad14[0x2]; public:
    Il2CppList<CharacterType>* boughtCharacters;
    Il2CppList<SkinType>* boughtSkins;
    Il2CppList<PowerUpLevel>* boughtPowerups;
    Il2CppList<WeaponType>* collectedWeapons;
    Il2CppList<WeaponType>* unlockedWeapons;
    Il2CppList<CharacterType>* unlockedCharacters;
    Il2CppList<CharacterType>* hostOnlyUnlockedCharacters;
    Il2CppList<CharacterType>* openedCoffins;
    Il2CppList<ItemType>* collectedItems;
    Il2CppList<AchievementType>* achievements;
    Il2CppList<SecretType>* secrets;
    Il2CppList<StageType>* unlockedStages;
    Il2CppList<StageType>* unlockedHypers;
    Il2CppList<PowerUpType>* unlockedPowerUpRanks;
    Il2CppList<ArcanaType>* unlockedArcanas;
    Il2CppList<PowerUpType>* disabledPowerups;
    Il2CppDictionary<EnemyType, int>* KillCount;
    Il2CppDictionary<ItemType, int>* pickupCount;
    Il2CppDictionary<PropType, int>* destroyedCount;
    Il2CppDictionary<CharacterType, Il2CppList<StageType>*>* stageCompletionLog;
    Il2CppDictionary<CharacterType, Il2CppList<CharacterStageData*>*>* characterStageData;
    Il2CppDictionary<CharacterType, int>* characterEnemiesKilled;
    Il2CppDictionary<CharacterType, int>* characterSurvivedMinutes;
    Il2CppDictionary<CharacterType, Il2CppList<SkinType>*>* unlockedSkins;
    Il2CppDictionary<CharacterType, Il2CppList<SkinType>*>* unlockedSkinsV2;
    Il2CppDictionary<CharacterType, int>* selectedSkins;
    Il2CppDictionary<CharacterType, SkinType>* selectedSkinsV2;
    Il2CppDictionary<StageType, BgmType>* musicSelectionPerStage;
    Il2CppString* checksum;
    Il2CppDictionary<CharacterType, Il2CppDictionary<Il2CppString*, float>*>* characterEggInfo;
    Il2CppDictionary<CharacterType, float>* characterEggCount;
    float totalEggCount;
    bool didIt;
private: char pad15[0x3]; public:
    int seals;
private: char pad16[0x4]; public:
    Il2CppList<ItemType>* SealedItems;
    Il2CppList<WeaponType>* SealedWeapons;
    Il2CppList<ItemType>* ContentGroupSealedItems;
    Il2CppList<WeaponType>* ContentGroupSealedWeapons;
    bool enableBonusAdsMechanics;
    bool screenShakeEnabled;
    bool controllerVibrationEnabled;
    bool assignControllerToPlayer1;
    bool popupsShouldFollowPriority;
    bool showPlayerIndicators;
    bool permanentCoopOutlines;
    bool tintUISelection;
    Il2CppArrayT<unsigned int>* playerColours;
    bool sequentialChestMode;
    bool hideDebugUI;
    bool hideGameUI;
    bool disableMovingBackground;
    bool disableBlood;
private: char pad17[0x3]; public:
    BorderType borderType;
    bool pixelFont;
    bool displayDefangedEnemies;
    bool stageLighting;
    bool hasSeenAdventureReveal;
    CollectionsPageFilterType collectionFilterMode;
    bool shouldPlayAdventureReveal;
    bool hideUnavailableAdventures;
    bool hasSeenAdventuresIntroTutorial;
private: char pad18[0x1]; public:
    float adventureStars;
    bool hasPlayedStage3;
    bool hasSeenDarkanaTransition;
    bool hasFixedSkinIds;
private: char pad19[0x1]; public:
    Il2CppList<ContentGroupType>* banishedContentGroups;
    bool showTPCredits;
private: char pad20[0x3]; public:
    int TP_FrozenShadesCount;
    int TP_AxeArmorCount;
    int TP_SniperCount;
    int TP_PortraitsCount;
    int libraryMerchantGoldSpent;
    bool passedGaeaEvent;
private: char pad21[0x3]; public:
    int EME_NextBossBiome;
    int WW_ZoneProgress;
    Nullable<AdventureType> selectedAdventureTypeValue;
    int adventureCompletionCount;
    Il2CppList<AdventureAchievementType>* adventureProgress;
    Il2CppDictionary<AdventureType, PlayerOptionsData*>* adventuresSaveData;
    float totalAdventurePlaytime;
    float allTimeAdventurePlaytime;
    Il2CppDictionary<PowerUpType, int>* ascensionPointsAllocation;
    Il2CppList<AdventureType>* completedAdventures;
    bool hasSeenMerchantTutorial;
private: char pad22[0x7]; public: //nothing here
    Il2CppList<AdventureType>* seenAscensionPopups;
    Il2CppDictionary<PropType, int>* runDestroyedProps;
    Il2CppDictionary<ItemType, int>* runItemsPickupCount;
    StageType nextAutoSelectStage;
private: char pad23[0x4]; public: //nothing here
    Il2CppDictionary<int, CoopSelections*>* multiplayerSelections;
    Il2CppList<CharacterType>* onlineMultiplayerSelections;
    //end
};
#pragma pack(pop)
//constexpr int hovertrick = offsetof(PlayerOptionsData, soundsVolume);
static_assert(offsetof(PlayerOptionsData, saveSyncPlatformAchievements) == 0x20);
static_assert(offsetof(PlayerOptionsData, saveOriginalPlatform) == 0x24);
static_assert(offsetof(PlayerOptionsData, itemsInCollection) == 0x38);
static_assert(offsetof(PlayerOptionsData, itemsInUnlocks) == 0x3C);
static_assert(offsetof(PlayerOptionsData, itemsInSecrets) == 0x40);
static_assert(offsetof(PlayerOptionsData, selectedCharacter) == 0x44);
static_assert(offsetof(PlayerOptionsData, selectedStage) == 0x48);
static_assert(offsetof(PlayerOptionsData, selectedHyper) == 0x4C);
static_assert(offsetof(PlayerOptionsData, selectedLimitBreak) == 0x50);
static_assert(offsetof(PlayerOptionsData, selectedSharePassives) == 0x54);
static_assert(offsetof(PlayerOptionsData, selectedArcana) == 0x58);
static_assert(offsetof(PlayerOptionsData, selectedSurvarots) == 0x5C);
static_assert(offsetof(PlayerOptionsData, forcedSurvarots) == 0x5D);
static_assert(offsetof(PlayerOptionsData, inGameFoundSurvarots) == 0x60);
static_assert(offsetof(PlayerOptionsData, selectedRandomEvents) == 0x64);
static_assert(offsetof(PlayerOptionsData, selectedBGMSave) == 0x66);
static_assert(offsetof(PlayerOptionsData, selectedBGM) == 0x68);
static_assert(offsetof(PlayerOptionsData, bgmModType) == 0x6C);
static_assert(offsetof(PlayerOptionsData, selectedMaxWeapons) == 0x78);
static_assert(offsetof(PlayerOptionsData, isFullscreen) == 0x7C);
static_assert(offsetof(PlayerOptionsData, version) == 0x80);
static_assert(offsetof(PlayerOptionsData, coins) == 0x84);
static_assert(offsetof(PlayerOptionsData, inGameCoins) == 0x88);
static_assert(offsetof(PlayerOptionsData, kills) == 0x8C);
static_assert(offsetof(PlayerOptionsData, bossKills) == 0x90);
static_assert(offsetof(PlayerOptionsData, inGamePickups) == 0x98);
static_assert(offsetof(PlayerOptionsData, inGameWeapons) == 0xA0);
static_assert(offsetof(PlayerOptionsData, inGameCoffins) == 0xA8);
static_assert(offsetof(PlayerOptionsData, inGameBossesTypes) == 0xB0);
static_assert(offsetof(PlayerOptionsData, inGameStarryHeavnes) == 0xB8);
static_assert(offsetof(PlayerOptionsData, lifetimeCoins) == 0xCC);
static_assert(offsetof(PlayerOptionsData, totalCoins) == 0xD0);
static_assert(offsetof(PlayerOptionsData, reducePhysics) == 0x108);
static_assert(offsetof(PlayerOptionsData, language) == 0x128);
static_assert(offsetof(PlayerOptionsData, showPickups) == 0x138);
static_assert(offsetof(PlayerOptionsData, longestGoldFever) == 0x13C);
static_assert(offsetof(PlayerOptionsData, highestGoldFever) == 0x140);
static_assert(offsetof(PlayerOptionsData, hasUsedMirror) == 0x144);
static_assert(offsetof(PlayerOptionsData, boughtCharacters) == 0x148);
static_assert(offsetof(PlayerOptionsData, boughtSkins) == 0x150);
static_assert(offsetof(PlayerOptionsData, boughtPowerups) == 0x158);
static_assert(offsetof(PlayerOptionsData, collectedWeapons) == 0x160);
static_assert(offsetof(PlayerOptionsData, achievements) == 0x190);
static_assert(offsetof(PlayerOptionsData, checksum) == 0x228);
static_assert(offsetof(PlayerOptionsData, totalEggCount) == 0x240);
static_assert(offsetof(PlayerOptionsData, seals) == 0x248);
static_assert(offsetof(PlayerOptionsData, screenShakeEnabled) == 0x271);
static_assert(offsetof(PlayerOptionsData, tintUISelection) == 0x277);
static_assert(offsetof(PlayerOptionsData, sequentialChestMode) == 0x280);
static_assert(offsetof(PlayerOptionsData, disableBlood) == 0x284);
static_assert(offsetof(PlayerOptionsData, borderType) == 0x288);
static_assert(offsetof(PlayerOptionsData, pixelFont) == 0x28C);
static_assert(offsetof(PlayerOptionsData, hasSeenAdventureReveal) == 0x28F);
static_assert(offsetof(PlayerOptionsData, shouldPlayAdventureReveal) == 0x294);
static_assert(offsetof(PlayerOptionsData, adventureStars) == 0x298);
static_assert(offsetof(PlayerOptionsData, hasPlayedStage3) == 0x29C);
static_assert(offsetof(PlayerOptionsData, hasFixedSkinIds) == 0x29E);
static_assert(offsetof(PlayerOptionsData, showTPCredits) == 0x2A8);
static_assert(offsetof(PlayerOptionsData, TP_FrozenShadesCount) == 0x2AC);
static_assert(offsetof(PlayerOptionsData, EME_NextBossBiome) == 0x2C4);
static_assert(offsetof(PlayerOptionsData, adventureCompletionCount) == 0x2D4);
static_assert(offsetof(PlayerOptionsData, adventureProgress) == 0x2D8);
static_assert(offsetof(PlayerOptionsData, completedAdventures) == 0x2F8);
static_assert(offsetof(PlayerOptionsData, hasSeenMerchantTutorial) == 0x300);
static_assert(offsetof(PlayerOptionsData, seenAscensionPopups) == 0x308);
static_assert(offsetof(PlayerOptionsData, nextAutoSelectStage) == 0x320);
static_assert(offsetof(PlayerOptionsData, onlineMultiplayerSelections) == 0x330);

#pragma pack(push, 1)
struct PlayerModifierStats
{
    Il2CppObjectBase obj;
    EggFloat* Might;
    EggFloat* Area;
    EggFloat* ProjectileSpeed;
    EggFloat* MoveSpeed;
    EggFloat* Growth;
    EggFloat* Luck;
    EggFloat* Duration;
    EggFloat* Cooldown;
    EggFloat* Amount;
    EggFloat* Armor;
    EggFloat* Greed;
    EggFloat* Regen;
    EggFloat* ReRolls;
    EggFloat* Skips;
    EggFloat* MaxHp;
    EggFloat* Magnet;
    EggFloat* Curse;
    EggFloat* Banishes;
    EggDouble* Revivals;
    int UsedRevivals;
    float Shroud;
    float Shields;
    int Charm;
    float Defang;
    float Thorns;
    float InvulTimeBonus;
    float Fever;
    float Recycle;
};
struct MagnetZone
{
    private: char pad0[0x68]; public:
    CharacterController* targetCharacter;
    EggFloat* Radius;
};

struct HyperMod
{
    Il2CppObjectBase obj;
    float rate;
    int detune;
};
struct ForsakenMod
{
    Il2CppObjectBase obj;
    float rate;
    int detune;
};
struct MusicData
{
    Il2CppObjectBase obj;
    Il2CppString* title;
    Il2CppString* author;
    Il2CppString* source;
private: char pad1[0x18]; public:
    bool isUnlocked;
private: char pad2[0x7]; public:
    Il2CppString* icon;
    HyperMod* hyperMod;
	ForsakenMod* forsakenMod;
};
//constexpr int hovertrick = offsetof(MusicData, allMusicData);
static_assert(offsetof(MusicData, title) == 0x10);
static_assert(offsetof(MusicData, author) == 0x18);
static_assert(offsetof(MusicData, isUnlocked) == 0x40);
static_assert(offsetof(MusicData, icon) == 0x48);

struct GameSessionData
{
    Il2CppObjectBase obj;
    CharacterController* activeCharacter;
};
//constexpr int hovertrick = offsetof(GameSessionData, activeCharacter);
static_assert(offsetof(GameSessionData, activeCharacter) == 0x10);

struct PlayerOptions
{
private: char pad0[0x30]; public:
    GameSessionData* gameSessionData;
    DataManager* dataManager;
};
//constexpr int hovertrick = offsetof(PlayerOptions, gameSessionData);
static_assert(offsetof(PlayerOptions, gameSessionData) == 0x30);

struct TimeMods
{
    Il2CppObjectBase obj;
    Nullable<float> Start;
    Nullable<float> HpPerMinute;
    Nullable<float> SpeedPerMinute;
};
struct StageModifiers
{
    Il2CppObjectBase obj;
    Nullable<float> TimeLimit; // 0x10
    Nullable<float> ClockSpeed; // 0x18
    Nullable<float> PlayerPxSpeed; // 0x20
    Nullable<float> EnemySpeed; // 0x28
    Nullable<float> ProjectileSpeed; // 0x30
    Nullable<float> GoldMultiplier; // 0x38
    Nullable<float> EnemyHealthMultiplier; // 0x40
    Nullable<float> LuckBonus; // 0x48
    Nullable<float> XpBonus; // 0x50
    Nullable<float> StartingSpawns; // 0x58
    Nullable<float> EndCycles; // 0x60
    TimeMods* TimeMods; // 0x68
    bool unlocked; // 0x70
private: char pad1[0x3]; public:
    float EnemyMinimumMul; // 0x74
    float BGM_rate; // 0x78
    int BGM_detune; // 0x7C
    bool BGM_ignoreModsForNewSoundtrack; // 0x80
private: char pad2[0x3]; public:
    float BGM_new_rate; // 0x84
    int BGM_new_detune; // 0x88
    Nullable<unsigned int> tint; // 0x8C
};

struct HardBounds
{
    Il2CppObjectBase obj;
    float x;
    float y;
    float width;
    float height;
};

struct Tileset
{
    Il2CppObjectBase obj;
    Il2CppString* setKey; // 0x10
    Il2CppString* setPath; // 0x18
    Il2CppString* mapKey; // 0x20
    Il2CppString* mapPath; // 0x28
    bool isTiling; // 0x30
    bool isHorizontalRoad; // 0x31
    bool hasWallsCheckDestructibleLogic; // 0x32
private: char pad1[0x1]; public:
    Nullable<float> SizeX; // 0x34
    Nullable<float> SizeY; // 0x3C
    Nullable<float> minTreasureX; // 0x44
    Nullable<float> maxTreasureX; // 0x4C
    Nullable<float> minTreasureY; // 0x54
    Nullable<float> maxTreasureY; // 0x5C
    Nullable<unsigned int> tint; // 0x64
    Nullable<ItemType> mapRelic; // 0x6C
    Il2CppString* detailsTexture; // 0x78
    HardBounds* hardBounds; // 0x80
};

struct TreasurePrizeTypePair
{
    Il2CppObjectBase obj;
    PrizeType prizeType;
    ItemType prizeItem;
    WeaponType prizeWeapon;
    int Level;
};

struct Treasure
{
    Il2CppObjectBase obj;
    Il2CppList<float>* chances;
    int level;
private: char pad1[0x4]; public:
    Il2CppList<Nullable<PrizeType>>* prizeTypes;
    Il2CppList<WeaponType>* fixedPrizes;
    bool hasArcana;
    bool hasRandoms;
    bool QuickTreasureAnim;
private: char pad2[0x5]; public:
    CharacterController* openingPlayer;
    CharacterController* winningPlayer;
    Il2CppList<TreasurePrizeTypePair*>* prizes;
    Il2CppList<WeaponType>* accumulatedWeaponPrizes;
    float accumulatedCoinPrize;
    float quickAddedCoins;
    Il2CppList<WeaponType>* accumulatedWorldSpacePrizes;
};
//constexpr int hovertrick = offsetof(Treasure, prizeTypes);
static_assert(offsetof(Treasure, accumulatedWorldSpacePrizes) == 0x60);

struct Background
{
    Il2CppObjectBase obj;
    Il2CppString* texture;
    Nullable<StageType> stageType;
    //done
};

struct PreloadData
{
    Il2CppObjectBase obj;
    Il2CppList<CharacterType>* characters; // 0x10
    Il2CppList<Il2CppString*>* textures; // 0x18
    Il2CppList<Il2CppString*>* videos; // 0x20
    Il2CppList<BgmType>* bgm; // 0x28
};

struct CustomMerchantData
{
    Il2CppObjectBase obj;
    CharacterType MerchantCharacter;
    Il2CppString* PortraitSprite;
    Il2CppString* PortraitSpriteTexture;
    Il2CppString* StaticSprite;
    Il2CppString* StaticSpriteTexture;
    Il2CppList<DlcType>* DLC;
    bool IsAnimated;
    bool HideBackgroundParticles;
    bool HideBackgroundWindows;
    bool HideBackgroundMask;
    Nullable<float> CustomCooldown;
    Il2CppString* TextLocKey;
    Nullable<float> MerchantXPos;
    Nullable<float> MerchantYPos;
    Nullable<Vec2> BodyOffset;
private: char pad_0001[0xC]; public:
    Il2CppList<WeaponType>* MerchantInventory;
    Il2CppList<ItemType>* MerchantInventoryItems;
};
//constexpr int hovertrick = offsetof(CustomMerchantData, MerchantInventory);
static_assert(offsetof(CustomMerchantData, MerchantInventory) == 0x78);

struct FollowerData
{
    Il2CppObjectBase obj;
    CharacterType FollowerCharacter;
    AIType FollowerAI;
    bool IsFollowerInvinceable;
    bool CountsAsMainCharacterForRevivals;
    bool ManualLevelUps;
    bool TrackedByCamera;
    bool ShouldFollowMainPlayer;
    bool AllowDuplicates;
private: char pad_0001[0x2]; public:
    int EveryXLevels;
    bool ShouldSharePassives;
    bool ShouldFollowerReactToArcanas;
};
//constexpr int hovertrick = offsetof(FollowerData, MerchantInventory);
static_assert(offsetof(FollowerData, EveryXLevels) == 0x20);

struct StageData
{
    Il2CppObjectBase obj;
    int order;
    Nullable<StageType> tilesetStageType;
private: char pad_001C[0x4]; public:
    Il2CppString* stageName;
    Il2CppString* description;
    Il2CppString* uiTexture;
    Il2CppString* uiFrame;
    Il2CppString* texture;
    Il2CppString* bestiaryBG;
    Il2CppString* stageNumber;
    Il2CppString* frameName;
    Il2CppString* frameNameUnlock;
    bool unlocked;
private: char pad_0069[0x3]; public:
    BgmType BGM;
    Nullable<BgmType> sideBBGM;
    Il2CppString* legacyBGM;
    Il2CppString* tips;
    Il2CppString* hyperTips;
    bool validForCharcaterData;
    bool hidden;
    bool alwaysHidden;
private: char pad_0093[0x5]; public:
    StageModifiers* mods;
    StageModifiers* _hyper;
    StageModifiers* inverse;
    Tileset* tileset;
    Background* background;
private: char pad_6666[0x8]; public:
    Il2CppString* spawnType;
    int startingSpawns;
    int minute;
    bool randomMinutes;
private: char pad_00D9[0x7]; public:
    Il2CppString* destructibleType;
    float destructibleFreq;
    float destructibleChance;
    float destructibleChanceMax;
    int maxDestructibles;
    Il2CppString* BGTextureName;
    Il2CppString* Extra_Texture;
    BgmType Extra_Audio;
    bool isMerchantBanned;
    bool isSpeedupBanned;
    bool hasLights;
    bool disableGlobalLight;
    bool hasCharacterSpotlight;
    bool dayNight;
private: char pad_0112[0x2]; public:
    unsigned int DayColor;
    unsigned int NightColor;
    unsigned int InverseDayColor;
    unsigned int InverseNightColor;
private: char pad_0124[0x1C]; public:
    int minimum;
    float frequency;
    Nullable<float> zoom;
    Il2CppList<Nullable<EnemyType>>* enemies;
    Il2CppList<Nullable<EnemyType>>* bosses;
    Treasure* treasure;
    Nullable<EnemyType> arcanaHolder;
    Treasure* arcanaTreasure;
    private: char pad_1232[0x8]; public:
    private: char pad_122231[0x8]; public:
    Nullable<CharacterType> cff;
    Il2CppList<ItemType>* LootTable;
    Il2CppList<ItemType>* relics;
    Il2CppList<ItemType>* relics2;
    Il2CppList<ItemType>* yellowRelics;
    PreloadData* preload;
    Il2CppList<CustomMerchantData>* adventureMerchants;
    Il2CppList<FollowerData>* defaultFollowers;
    Nullable<float> adventurePriceMarkup;
    bool isRacingStage;
    bool skipVisualInversion;
    bool allowVisualInversion;
private: char pad_01D3[0x5]; public:
    Il2CppString* biome;
    Il2CppList<Il2CppString*>* biomes;
};
//constexpr int hovertrick = offsetof(StageData, minimum);
static_assert(offsetof(StageData, order) == 0x10);
static_assert(offsetof(StageData, tilesetStageType) == 0x14);
static_assert(offsetof(StageData, stageName) == 0x20);
static_assert(offsetof(StageData, description) == 0x28);
static_assert(offsetof(StageData, uiTexture) == 0x30);
static_assert(offsetof(StageData, uiFrame) == 0x38);
static_assert(offsetof(StageData, texture) == 0x40);
static_assert(offsetof(StageData, bestiaryBG) == 0x48);
static_assert(offsetof(StageData, stageNumber) == 0x50);
static_assert(offsetof(StageData, frameName) == 0x58);
static_assert(offsetof(StageData, frameNameUnlock) == 0x60);
static_assert(offsetof(StageData, unlocked) == 0x68);
static_assert(offsetof(StageData, BGM) == 0x6C);
static_assert(offsetof(StageData, sideBBGM) == 0x70);
static_assert(offsetof(StageData, legacyBGM) == 0x78);
static_assert(offsetof(StageData, tips) == 0x80);
static_assert(offsetof(StageData, hyperTips) == 0x88);
static_assert(offsetof(StageData, validForCharcaterData) == 0x90);
static_assert(offsetof(StageData, hidden) == 0x91);
static_assert(offsetof(StageData, alwaysHidden) == 0x92);
static_assert(offsetof(StageData, mods) == 0x98);
static_assert(offsetof(StageData, _hyper) == 0xA0);
static_assert(offsetof(StageData, inverse) == 0xA8);
static_assert(offsetof(StageData, tileset) == 0xB0);
static_assert(offsetof(StageData, background) == 0xB8);
static_assert(offsetof(StageData, spawnType) == 0xC8);
static_assert(offsetof(StageData, startingSpawns) == 0xD0);
static_assert(offsetof(StageData, minute) == 0xD4);
static_assert(offsetof(StageData, randomMinutes) == 0xD8);
static_assert(offsetof(StageData, destructibleType) == 0xE0);
static_assert(offsetof(StageData, destructibleFreq) == 0xE8);
static_assert(offsetof(StageData, destructibleChance) == 0xEC);
static_assert(offsetof(StageData, destructibleChanceMax) == 0xF0);
static_assert(offsetof(StageData, maxDestructibles) == 0xF4);
static_assert(offsetof(StageData, BGTextureName) == 0xF8);
static_assert(offsetof(StageData, Extra_Texture) == 0x100);
static_assert(offsetof(StageData, Extra_Audio) == 0x108);
static_assert(offsetof(StageData, isMerchantBanned) == 0x10C);
static_assert(offsetof(StageData, isSpeedupBanned) == 0x10D);
static_assert(offsetof(StageData, hasLights) == 0x10E);
static_assert(offsetof(StageData, disableGlobalLight) == 0x10F);
static_assert(offsetof(StageData, hasCharacterSpotlight) == 0x110);
static_assert(offsetof(StageData, dayNight) == 0x111);
static_assert(offsetof(StageData, DayColor) == 0x114);
static_assert(offsetof(StageData, NightColor) == 0x118);
static_assert(offsetof(StageData, InverseDayColor) == 0x11C);
static_assert(offsetof(StageData, InverseNightColor) == 0x120);
static_assert(offsetof(StageData, minimum) == 0x140);
static_assert(offsetof(StageData, frequency) == 0x144);
static_assert(offsetof(StageData, zoom) == 0x148);
static_assert(offsetof(StageData, enemies) == 0x150);
static_assert(offsetof(StageData, bosses) == 0x158);
static_assert(offsetof(StageData, treasure) == 0x160);
static_assert(offsetof(StageData, arcanaHolder) == 0x168);
static_assert(offsetof(StageData, arcanaTreasure) == 0x170);
static_assert(offsetof(StageData, cff) == 0x188);
static_assert(offsetof(StageData, LootTable) == 0x190);
static_assert(offsetof(StageData, relics) == 0x198);
static_assert(offsetof(StageData, relics2) == 0x1A0);
static_assert(offsetof(StageData, yellowRelics) == 0x1A8);
static_assert(offsetof(StageData, preload) == 0x1B0);
static_assert(offsetof(StageData, adventureMerchants) == 0x1B8);
static_assert(offsetof(StageData, defaultFollowers) == 0x1C0);
static_assert(offsetof(StageData, adventurePriceMarkup) == 0x1C8);
static_assert(offsetof(StageData, isRacingStage) == 0x1D0);
static_assert(offsetof(StageData, skipVisualInversion) == 0x1D1);
static_assert(offsetof(StageData, allowVisualInversion) == 0x1D2);
static_assert(offsetof(StageData, biome) == 0x1D8);
static_assert(offsetof(StageData, biomes) == 0x1E0);

struct PowerUpData
{
    Il2CppObjectBase obj;
    int level;
    bool hidden;
private: char pad1[0x3]; public:
    Il2CppString* bulletType;
    Il2CppString* name;
    Il2CppString* description;
    Il2CppString* texture;
    Il2CppString* frameName;
    bool isPowerUp;
    bool isAnUnlockable;
private: char pad2[0x2]; public:
    int price;
    int unlockedRank;
    bool isSpecial;
    bool specialBG;
};
//constexpr int hovertrick = offsetof(PowerUpData, level);
static_assert(offsetof(PowerUpData, level) == 0x10);
static_assert(offsetof(PowerUpData, bulletType) == 0x18);
static_assert(offsetof(PowerUpData, price) == 0x44);
static_assert(offsetof(PowerUpData, specialBG) == 0x4D);

struct DataManager
{
private: char pad0[0x18]; public:
    PlayerOptions* playerOptions;
    Il2CppDictionary<CharacterType, Il2CppList<CharacterData*>*>* characterData;
    Il2CppDictionary<PowerUpType, Il2CppList<PowerUpData*>*>* powerUpData;
    Il2CppDictionary<StageType, Il2CppList<StageData*>*>* stageData;
    Il2CppDictionary<WeaponType, Il2CppList<WeaponData*>*>* weaponData;
    Il2CppDictionary<EnemyType, Il2CppList<EnemyData*>*>* enemyData;
    bool characterDataChangedForOnline;
    bool powerUpDataChangedForOnline;
    bool stageDataChangedForOnline;
    bool weaponDataChangedForOnline;
    bool enemyDataChangedForOnline;
private: char pad1[0x3]; public:
    Il2CppDictionary<DlcType, Il2CppDictionary<CharacterType, Il2CppList<CharacterData*>*>*>* dlcCharacterData;
    Il2CppDictionary<DlcType, Il2CppDictionary<PowerUpType, Il2CppList<PowerUpData*>*>*>* dlcPowerUpData;
    Il2CppDictionary<DlcType, Il2CppDictionary<StageType, Il2CppList<StageData*>*>*>* dlcStageData;
    Il2CppDictionary<DlcType, Il2CppDictionary<WeaponType, Il2CppList<WeaponData*>*>*>* dlcWeaponData;
    Il2CppDictionary<DlcType, Il2CppDictionary<EnemyType, Il2CppList<EnemyData*>*>*>* dlcEnemyData;
    Il2CppDictionary<DlcType, Il2CppDictionary<BgmType, MusicData*>*>* dlcMusicData;
private: char pad2[0x118]; public:
    Il2CppDictionary<BgmType, MusicData*>* allMusicData;
};
//constexpr int hovertrick = offsetof(DataManager, allMusicData);
static_assert(offsetof(DataManager, playerOptions) == 0x18);
static_assert(offsetof(DataManager, dlcCharacterData) == 0x50);
static_assert(offsetof(DataManager, allMusicData) == 0x198);

struct MainMenuPage
{
private: char pad0[0x248]; public:
    DataManager* dataManager;
};
//constexpr int hovertrick = offsetof(MainMenuPage, dataManager);
static_assert(offsetof(MainMenuPage, dataManager) == 0x248);

struct CharacterSelectionPage
{
private: char pad0[0x238]; public:
    DataManager* dataManager;
};
//constexpr int hovertrick = offsetof(struct CharacterSelectionPage
static_assert(offsetof(CharacterSelectionPage, dataManager) == 0x238);

struct StageSelectPage
{
private: char pad0[0x1F0]; public:
    DataManager* dataManager;
};
//constexpr int hovertrick = offsetof(StageSelectPage, dataManager);
static_assert(offsetof(StageSelectPage, dataManager) == 0x1F0);

struct PausePage
{
private: char pad0[0x1B0]; public:
    DataManager* dataManager;
};
//constexpr int hovertrick = offsetof(PausePage, dataManager);
static_assert(offsetof(PausePage, dataManager) == 0x1B0);

struct Stage
{
private: char pad0[0x40]; public:
    StageType stageType;
    int currentMinute;
    int maxStageDataMinute;
    int maximum;
    int lastMinimum;
    int lastMaximum;
    int defaultMaximum;
    float minMultiplier;
    float onlineEnemyMultiplier;
    float effectiveSpawnFrequency;
private: char pad1[0x20]; public:
    bool hasTileSet;
private: char pad2[0x3]; public:
    SpawnType spawnType;
    bool hasAttachedTreasure;
    bool compressTime;
private: char pad3[0x2]; public:
    float pizzaDelay;
private: char pad4[0x30]; public:
    Il2CppList<Vec2>* cartLocations;
    Il2CppList<Vec2>* windowLocations;
    Il2CppList<Vec2>* pizzaLocations;
private: char pad5[0x8]; public:
    Il2CppList<Vec2>* tiledPositions;
private: char pad6[0x10]; public:
    bool shadowsVisible;
private: char pad7[0xA0]; public:
    bool isCharmApplied;
    bool disableMinueteSpawning;
private: char pad8[0xD]; public:
    void* mainCamera;
private: char pad9[0x8]; public:
    DataManager* dataManager;
};
//constexpr int hovertrick = offsetof(Stage, dataManager);
static_assert(offsetof(Stage, hasTileSet) == 0x88);
static_assert(offsetof(Stage, spawnType) == 0x8C);
static_assert(offsetof(Stage, pizzaDelay) == 0x94);
static_assert(offsetof(Stage, cartLocations) == 0xC8);
static_assert(offsetof(Stage, tiledPositions) == 0xE8);
static_assert(offsetof(Stage, shadowsVisible) == 0x100);
static_assert(offsetof(Stage, isCharmApplied) == 0x1A1);
static_assert(offsetof(Stage, mainCamera) == 0x1B0);
static_assert(offsetof(Stage, dataManager) == 0x1C0);

struct PlayerStat
{
    Il2CppObjectBase obj;
    PowerUpType type;
    int level; 
    Il2CppList<PowerUpData*>* data;
    double value;
};
struct PlayerStats
{
    Il2CppObjectBase obj;
    DataManager* dataManager;
    PlayerOptions* playerOptions;
    void* signalBus;
    int totalPowerUpCount;
private: char pad0[0x4]; public:
    Il2CppDictionary<PowerUpType, PlayerStat*>* stats;
};
//constexpr int hovertrick = offsetof(PlayerStats, stats);
static_assert(offsetof(PlayerStats, stats) == 0x30);

struct GameManager
{
private: char pad0[0x30]; public:
    MagnetZone* magnetZonePrefab;
private: char pad1[0x68]; public:
    LootManager* lootManager;
    WeaponsFacade* weaponsFacade;
private: char pad2[0x8]; public:
    Stage* stage;
private: char pad3[0x20]; public:
    GameSessionData* gameSessionData;
    LevelUpFactory* levelUpFactory;
private: char pad4[0x18]; public:
    DataManager* dataManager;
    PlayerStats* playerStats;
    ArcanaManager* arcanaManager;
private: char pad6[0x178]; public:
    Il2CppList<CharacterController*>* characters;
    Il2CppList<CharacterController*>* mainCharacters;
    Il2CppList<CharacterController*>* charactersLevelingUp;
private: char pad7[0x130]; public:
    float survivedSeconds;
};
//constexpr int hovertrick = offsetof(GameManager, survivedSeconds);
static_assert(offsetof(GameManager, lootManager) == 0xA0);
static_assert(offsetof(GameManager, stage) == 0xB8);
static_assert(offsetof(GameManager, gameSessionData) == 0xE0);
static_assert(offsetof(GameManager, dataManager) == 0x108);
static_assert(offsetof(GameManager, arcanaManager) == 0x118);
static_assert(offsetof(GameManager, characters) == 0x298);
static_assert(offsetof(GameManager, charactersLevelingUp) == 0x2A8);
static_assert(offsetof(GameManager, survivedSeconds) == 0x3E0);

struct ArcadeBodyBounds
{
private: char pad0[0x20]; public:
    float x; // 0x20
    float y; // 0x24
    float width; // 0x28
    float height; // 0x2C
};
struct CharacterController
{
private: char pad0[0x58]; public://nothing useful up to here
    Vec2 currentDefaultMapPosition;
    unsigned int randomEnemyPickerSeed;
    int playerIndex;
private: char pad1[0x20]; public:
    GameManager* gameManager;
private: char pad1a[0x28]; public:
    void* cachedTransform;
private: char pad1b[0x50]; public:
    CharacterData* currentCharacterData;
    CharacterData* currentSkinData;
    CharacterData* levelZeroCharacterData;
    Il2CppList<WeaponType>* weaponSelection;
    WeaponType startingWeaponType;
    CharacterType characterType;
    SkinType skinType;
private: char pad2[0x1C]; public:
    bool receivingDamage;
    bool playDamageSFX;
private: char pad3[0x2]; public:
    float invincibilityTimer;
    bool hasWalkingAnimation;
    bool hasIdleAnimation;
private: char pad4[0xE]; public:
    Vec2 currentDirection;
    Vec2 currentDirectionRaw;
    Vec2 lastMovementDirection;
    bool actionButtonPressed;
private: char pad5[0xF]; public:
    ArcadeBodyBounds* worldBoxCollider;
    ArcadeBodyBounds* coopMovementBoxCollider;
private: char pad5a[0x38]; public:
    bool followPlayerOne;
private: char pad6[0x3]; public:
    float defaultSpriteWidth;
private: char pad7[0x8]; public:
    bool useWorldSpaceMovementLimits;
private: char pad8[0x27]; public:
    PlayerModifierStats* playerStats;
    float slowMultiplier;
    bool isSlow;
private: char pad9[0x3]; public:
    float hp;
    int level;
    float walked;
    Vec2 lastFacingDirection;
    float xp;
    bool isAnimForced;
    bool canFlip;
    bool isFlipped;
private: char pad10[0x1]; public:
    float shieldInvulTime;
    MagnetZone* magnetZone;
private: char pad11[0x28]; public:
    float slowTime;
    float goldFeverMultiplier;
private: char pad12[0x8]; public:
    bool isInFinalStage;
    bool isDead;
    bool isInvulnerable;
    bool isSendingDeath;
    bool isInitialized;
    bool isLastBreathEnabled;
    bool hasLastBreath;
private: char pad13[0x9]; public:
    bool isCriticalHPEnabled;
    bool hasAnyCriticalHPSkill;
private: char pad14[0xE]; public:
    float criticalHPThreshold;
    bool hasThorns;
private: char pad15[0x3]; public:
    int maxWeaponCount;
    int maxPassiveCount;
    int maxWeaponBonus;
    int maxAccessoryBonus;
private: char pad16[0x40]; public:
    float debuffSlow;
private: char pad17[0x2C]; public:
    bool multiplayerRevivalAllowed;
private: char pad18[0x17]; public:
    PickupMode pickupMode;
    bool permanentInvulnerability;
    bool blockInput;
    bool trackedByCamera;
private: char pad19[0x1]; public:
    float moveSpeedMultiplier;
    float armorManualIncrease;
    Il2CppList<WeaponType>* glimmeredTechniques;
private: char pad20[0x30]; public:
    float skillCardsMultiplier;
    float tempCurse;
    unsigned int followerLevelUpShuffleSeed;
    bool alwaysCoinBag;
    bool alwaysRoast;
    bool alwaysRandomLimitBreak;
    bool isFollowerSharingPassives;
    bool isFollowerReactingToArcanas;
private: char pad21[0x3]; public:
    Vec2 externalVelocity;
    bool CountsAsMainCharacterForRevivals;
private: char pad22[0x3]; public:
    float silentCooldown;
    float silentMight;
    Il2CppString* currentWalkAnimName;
    bool isPlatformMovementActive;
private: char pad23[0x3]; public:
    float rapidFireLife;
    float barrierNumber;
private: char pad24[0xC]; public:
    bool hasFourthLevelUpOption;
private: char pad25[0x7]; public:
    Il2CppList<Weapon*>* HeldShieldSlots;
    SfxType damageSound;
    float damageVolume;
    float damageBaseDetune;
    bool hasForcedSortingOrder;
private: char pad26[0x3]; public:
    int forcedSortingOrder;
};
//constexpr int hovertrick = offsetof(CharacterController, pickupMode);
static_assert(offsetof(CharacterController, currentDefaultMapPosition) == 0x58);
static_assert(offsetof(CharacterController, playerIndex) == 0x64);
static_assert(offsetof(CharacterController, gameManager) == 0x88);
static_assert(offsetof(CharacterController, cachedTransform) == 0xB8);
static_assert(offsetof(CharacterController, receivingDamage) == 0x158);
static_assert(offsetof(CharacterController, playDamageSFX) == 0x159);
static_assert(offsetof(CharacterController, invincibilityTimer) == 0x15C);
static_assert(offsetof(CharacterController, hasWalkingAnimation) == 0x160);
static_assert(offsetof(CharacterController, hasIdleAnimation) == 0x161);
static_assert(offsetof(CharacterController, currentDirection) == 0x170);
static_assert(offsetof(CharacterController, currentDirectionRaw) == 0x178);
static_assert(offsetof(CharacterController, lastMovementDirection) == 0x180);
static_assert(offsetof(CharacterController, actionButtonPressed) == 0x188);
static_assert(offsetof(CharacterController, worldBoxCollider) == 0x198);
static_assert(offsetof(CharacterController, coopMovementBoxCollider) == 0x1A0);
static_assert(offsetof(CharacterController, followPlayerOne) == 0x1E0);
static_assert(offsetof(CharacterController, defaultSpriteWidth) == 0x1E4);
static_assert(offsetof(CharacterController, useWorldSpaceMovementLimits) == 0x1F0);
static_assert(offsetof(CharacterController, playerStats) == 0x218);
static_assert(offsetof(CharacterController, slowMultiplier) == 0x220);
static_assert(offsetof(CharacterController, isSlow) == 0x224);
static_assert(offsetof(CharacterController, hp) == 0x228);
static_assert(offsetof(CharacterController, level) == 0x22C);
static_assert(offsetof(CharacterController, walked) == 0x230);
static_assert(offsetof(CharacterController, lastFacingDirection) == 0x234);
static_assert(offsetof(CharacterController, xp) == 0x23C);
static_assert(offsetof(CharacterController, isAnimForced) == 0x240);
static_assert(offsetof(CharacterController, canFlip) == 0x241);
static_assert(offsetof(CharacterController, isFlipped) == 0x242);
static_assert(offsetof(CharacterController, shieldInvulTime) == 0x244);
static_assert(offsetof(CharacterController, magnetZone) == 0x248);
static_assert(offsetof(CharacterController, slowTime) == 0x278);
static_assert(offsetof(CharacterController, goldFeverMultiplier) == 0x27C);
static_assert(offsetof(CharacterController, isInFinalStage) == 0x288);
static_assert(offsetof(CharacterController, isDead) == 0x289);
static_assert(offsetof(CharacterController, isInvulnerable) == 0x28A);
static_assert(offsetof(CharacterController, isSendingDeath) == 0x28B);
static_assert(offsetof(CharacterController, isInitialized) == 0x28C);
static_assert(offsetof(CharacterController, isLastBreathEnabled) == 0x28D);
static_assert(offsetof(CharacterController, hasLastBreath) == 0x28E);
static_assert(offsetof(CharacterController, isCriticalHPEnabled) == 0x298);
static_assert(offsetof(CharacterController, hasAnyCriticalHPSkill) == 0x299);
static_assert(offsetof(CharacterController, criticalHPThreshold) == 0x2A8);
static_assert(offsetof(CharacterController, hasThorns) == 0x2AC);
static_assert(offsetof(CharacterController, maxWeaponCount) == 0x2B0);
static_assert(offsetof(CharacterController, maxPassiveCount) == 0x2B4);
static_assert(offsetof(CharacterController, maxWeaponBonus) == 0x2B8);
static_assert(offsetof(CharacterController, maxAccessoryBonus) == 0x2BC);
static_assert(offsetof(CharacterController, debuffSlow) == 0x300);
static_assert(offsetof(CharacterController, multiplayerRevivalAllowed) == 0x330);
static_assert(offsetof(CharacterController, pickupMode) == 0x348);
static_assert(offsetof(CharacterController, permanentInvulnerability) == 0x34C);
static_assert(offsetof(CharacterController, blockInput) == 0x34D);
static_assert(offsetof(CharacterController, moveSpeedMultiplier) == 0x350);
static_assert(offsetof(CharacterController, armorManualIncrease) == 0x354);
static_assert(offsetof(CharacterController, tempCurse) == 0x394);
static_assert(offsetof(CharacterController, rapidFireLife) == 0x3C4);
static_assert(offsetof(CharacterController, barrierNumber) == 0x3C8);
static_assert(offsetof(CharacterController, hasFourthLevelUpOption) == 0x3D8);
static_assert(offsetof(CharacterController, damageSound) == 0x3E8);
static_assert(offsetof(CharacterController, damageVolume) == 0x3EC);
static_assert(offsetof(CharacterController, damageBaseDetune) == 0x3F0);
static_assert(offsetof(CharacterController, hasForcedSortingOrder) == 0x3F4);
static_assert(offsetof(CharacterController, forcedSortingOrder) == 0x3F8);

struct ColliderOverride
{
    Il2CppObjectBase obj;
    float radius;
    float offsetX;
    float offsetY;
    bool updateBasedOnFlipX;
    float offsetXWhenFlipped;
};

struct EnemyData
{
    Il2CppObjectBase obj;
    int level;
    float maxHp;
    float speed;
    float maxSpeed;
    float power;
private: char pad1[0x4]; public:
    Il2CppList<EnemySkillType>* skills;
    Nullable<int> minimumHpScalingLevel;
    Nullable<int> maximumHpScalingLevel;
    float shieldDuration;
    float knockback;
    float maxKnockback;
    float deathKB;
    Nullable<unsigned int> tint;
    float xp;
    int moreX;
    int moreY;
    float alpha;
    Nullable<float> scale;
    Nullable<float> res_Freeze;
    Nullable<float> res_Rosary;
    Nullable<float> res_Debuffs;
    Nullable<float> res_Knockback;
    Nullable<float> res_Corridor;
    Nullable<float> res_Defang;
    bool passThroughWalls;
    bool CannotBeFollower;
private: char pad2[0x6]; public:
    ColliderOverride* colliderOverride;
    Nullable<float> weakFire;
    bool skipCredits;
private: char pad3[0x3]; public:
    int idleFrameCount;
    float killedAmount;
private: char pad4[0x4]; public:
    Il2CppString* textureName;
    int end;
private: char pad5[0x4]; public:
    Il2CppList<Il2CppString*>* frameNames;
    float patrolDuration;
    Nullable<float> fireDelay;
    Nullable<float> fireDelayRandomness;
    Nullable<float> firingRangeMin;
    Nullable<float> firingRangeMax;
    Nullable<EnemyType> bulletType;
    Nullable<int> lives;
private: char pad6[0x4]; public:
    Il2CppString* flagName;
    EnemyData* alias;
    float feverValue;
private: char pad7[0x4]; public:
    Il2CppString* bName;
    Il2CppString* bDesc;
    Il2CppList<StageType>* bPlaces;
    bool bInclude;
    bool bIgnore;
    bool bHighlight;
private: char pad8[0x5]; public:
    Il2CppList<EnemyType>* bVariants;
    bool bIncludeColorVariants;
private: char pad9[0x3]; public:
    MaterialType materialType;
    Il2CppList<Il2CppString*>* Internal_FrameNamesAnim;
    Il2CppList<Il2CppList<Il2CppString*>*>* Internal_IdleAnimFrameNames;
    Il2CppList<Il2CppList<Il2CppString*>*>* Internal_DeathAnimFrameNames;
};
//constexpr int hovertrick = offsetof(EnemyData, skills);
static_assert(offsetof(EnemyData, level) == 0x10);
static_assert(offsetof(EnemyData, maxHp) == 0x14);
static_assert(offsetof(EnemyData, speed) == 0x18);
static_assert(offsetof(EnemyData, maxSpeed) == 0x1C);
static_assert(offsetof(EnemyData, power) == 0x20);
static_assert(offsetof(EnemyData, skills) == 0x28);
static_assert(offsetof(EnemyData, minimumHpScalingLevel) == 0x30);
static_assert(offsetof(EnemyData, shieldDuration) == 0x40);
static_assert(offsetof(EnemyData, xp) == 0x58);
static_assert(offsetof(EnemyData, passThroughWalls) == 0xA0);
static_assert(offsetof(EnemyData, CannotBeFollower) == 0xA1);
static_assert(offsetof(EnemyData, colliderOverride) == 0xA8);
static_assert(offsetof(EnemyData, weakFire) == 0xB0);
static_assert(offsetof(EnemyData, textureName) == 0xC8);
static_assert(offsetof(EnemyData, flagName) == 0x118);
static_assert(offsetof(EnemyData, bVariants) == 0x150);
static_assert(offsetof(EnemyData, materialType) == 0x15C);

struct EnemyController
{
private: char pad0[0x60]; public:
    bool killedByAuthority;
private: char pad1[0x2F]; public:
    GameSessionData* gameSessionData;
    GameManager* gameManager;
    DataManager* dataManager;
private: char pad2[0x8]; public:
    EnemyData* currentEnemyData;
    bool hasInitializedData;
private: char pad3[0x7]; public:
    PlayerOptions* playerOptions;
private: char pad4[0x38]; public:
    bool receivingDamage;
    bool passThroughWalls;
private: char pad5[0xA]; public:
    bool selfDestruct;
    bool isSelfDestructionTriggered;
private: char pad6[0x6]; public:
    float startingAngle;
private: char pad7[0xC]; public:
    bool hasATreasure;
private: char pad8[0xB]; public:
    float wiggleProgress;
    bool wiggleForward;
    bool wiggleInit;
private: char pad9[0x4A]; public:
    Vec2 spritePivot;
    bool canBeDamagedByBloodline;
private: char pad10[0xF]; public:
    bool allowAnimationPauseResume;
private: char pad11[0x3]; public:
    EnemyType enemyType;
    float damageKb;
    float defaultSpeed;
    float scaleMul;
    bool hpXLevel;
    bool fixedDirection;
    bool medusa;
private: char pad12[0x1]; public:
    float medusaElapsed;
private: char pad13[0xC]; public:
    float alpha;
    Il2CppString* defaultName;
    float damageWeakness;
    float maxDamageWeakness;
    int multiplayerCorpseFeedingCounter;
    bool isImmuneToModification;
private: char pad14[0x7]; public:
    Vec2 currentDirection;
    float hp;
    float maxHp;
    float distance;
    float speed;
    bool isTeleportOnCull;
    bool isBoss;
    bool dontTeleportOnFreeRoam;
    bool ignoreNetworkError;
private: char pad15[0xC]; public:
    bool isCullable;
    bool isStatic;
private: char pad16[0x2A]; public:
    float weakFire;
    float slow;
    bool isPatrolling;
private: char pad17[0x3]; public:
    float knockBack;
    bool isDefanged;
    bool isTimeStopped;
    bool isTimeSlowed;
private: char pad18[0x1]; public:
    float selfDestDistance;
    int stageEventId;
    bool conditionalCanMove;
    bool ignoreMovementFreezeFromTimeStop;
private: char pad19[0xE]; public:
    bool isDead;
};
//constexpr int hovertrick = offsetof(EnemyController, isDead);
static_assert(offsetof(EnemyController, gameSessionData) == 0x90);
static_assert(offsetof(EnemyController, currentEnemyData) == 0xB0);
static_assert(offsetof(EnemyController, playerOptions) == 0xC0);
static_assert(offsetof(EnemyController, receivingDamage) == 0x100);
static_assert(offsetof(EnemyController, passThroughWalls) == 0x101);
static_assert(offsetof(EnemyController, startingAngle) == 0x114);
static_assert(offsetof(EnemyController, hasATreasure) == 0x124);
static_assert(offsetof(EnemyController, wiggleProgress) == 0x130);
static_assert(offsetof(EnemyController, wiggleForward) == 0x134);
static_assert(offsetof(EnemyController, wiggleInit) == 0x135);
static_assert(offsetof(EnemyController, spritePivot) == 0x180);
static_assert(offsetof(EnemyController, allowAnimationPauseResume) == 0x198);
static_assert(offsetof(EnemyController, enemyType) == 0x19C);
static_assert(offsetof(EnemyController, medusaElapsed) == 0x1B0);
static_assert(offsetof(EnemyController, alpha) == 0x1C0);
static_assert(offsetof(EnemyController, hp) == 0x1E8);
static_assert(offsetof(EnemyController, distance) == 0x1F0);
static_assert(offsetof(EnemyController, isCullable) == 0x208);
static_assert(offsetof(EnemyController, weakFire) == 0x234);
static_assert(offsetof(EnemyController, isDead) == 0x260);

struct HealthBar
{
private: char pad0[0x30]; public:
    CharacterController* character;
};

struct LevelUpFactory
{
    Il2CppObjectBase obj;
    float defaultXPFactor;
    float currentXpFactor;
    float previousXpFactor;
    float chanceForExistingPowerUp;
    int levelUpOptions;
    int accumulatedWeight;
    bool useDebugLog;
private: char pad1[0x7]; public:
    GameSessionData* gameSessionData; // 0x30
    void* signalBus; // 0x38
    DataManager* dataManager; // 0x40
    PlayerOptions* playerOptions; // 0x48
    void* coopConfig;//CoopConfig* 0x50
    Il2CppList<WeaponType>* unlockedWeapons; // 0x58
    Il2CppList<CharacterController*>* cachedPlayerList; // 0x60
    Il2CppList<bool>* coopAmuletBag; // 0x68
};
//constexpr int hovertrick = offsetof(LevelUpFactory, gameSessionData);
static_assert(offsetof(LevelUpFactory, gameSessionData) == 0x30);
static_assert(offsetof(LevelUpFactory, coopConfig) == 0x50);

struct WeaponsFacade
{
    Il2CppObjectBase obj;
    void* weaponFactory;//dont care for this object
    void* signalBus;//dont care for this object
    LevelUpFactory* levelUpFactory;
    PlayerOptions* playerOptions;
    ArcanaManager* arcanaManager;
    //done
};

struct WeightedItem
{
    Il2CppObjectBase obj;
    ItemType itemType;
    float weight;
    //done
};
struct LootManager
{
    Il2CppObjectBase obj;
    DataManager* dataManager;
    GameSessionData* gameSessionData;
    Stage* stage;
    float accumulatedWeight;
    Il2CppList<WeightedItem*>* weightedStore;
    Il2CppList<ItemType>* forcedLootTable;
    Il2CppList<ItemType>* addedLoot;
    //done
};

struct WickedSeason
{
    Il2CppObjectBase obj;
    void* signalBus;//dont care for this object
    bool hasWickedSeason;
private: char pad1[0x3]; public:
    float seasonTime;
    float seasonDuration;
    int seasonIndex;
    float curse;
    float growth;
    float luck;
    float greed;
    Il2CppList<Il2CppString*>* wickedSeasonAttributes;
    Il2CppList<Il2CppString*>* seasonColors;
    Il2CppList<Il2CppString*>* seasonIcons;
    Il2CppList<SfxType>* seasonSfx;
};
//constexpr int hovertrick = offsetof(WickedSeason, seasonTime);
static_assert(offsetof(WickedSeason, seasonTime) == 0x1C);

struct ArcanaManager
{
    Il2CppObjectBase obj;
    GameSessionData* gameSessionData;
    PlayerOptions* playerOptions;
    WeaponsFacade* weaponsFacade;
    DataManager* dataManager;
    void* signalBus;//dont care for this object
    GameManager* gameManager;
    LootManager* lootManager;
private: char pad1[0x28]; public:
    WickedSeason* wickedSeason;
private: char pad2[0x18]; public:
    bool hasWickedSeason;
    bool hasSilentSanctuary;
    bool hasAstronomia;
    bool hasSapphireMist;
    bool hasBreadAnathema;
    bool hasMoonlightBolero;
    bool hasHailFromTheFuture;
    bool hasJetBlackWeapon;
    bool hasCrystalCries;
    bool hasMadMoon;
    bool hasVictorianHorror;
private: char pad3[0x1]; public:
    float silentCooldown;
    float silentMight;
    float heartOfFireStartingPower;
    Il2CppDictionary<CharacterController*, Il2CppList<WeaponType>*>* beginning;
    Il2CppList<ArcanaType>* activeArcanas;
    bool healOnCoins;
    bool coinFever;
    bool madGroove;
    bool canGather;
private: char pad4[0x4]; public:
    Il2CppList<WeaponType>* heartOfFireWeapons;
    float xpMultiplier;
    float divineBloodlineHpBonusUnit;
    bool hasDivineBloodline;
private: char pad5[0x3]; public:
    int minTreasureChestLevel;
    bool pewPew;
private: char pad6[0x3]; public:
    int maxArcanasPerRun;
    //Il2CppList<Destructible*>* newDestructibles;
};
//constexpr int hovertrick = offsetof(ArcanaManager, heartOfFireWeapons);
static_assert(offsetof(ArcanaManager, wickedSeason) == 0x70);
static_assert(offsetof(ArcanaManager, hasWickedSeason) == 0x90);
static_assert(offsetof(ArcanaManager, silentCooldown) == 0x9C);
static_assert(offsetof(ArcanaManager, heartOfFireWeapons) == 0xC0);
static_assert(offsetof(ArcanaManager, maxArcanasPerRun) == 0xDC);

//dunno the real name but this is UnityPlayer.dll specific
struct UnityTime
{
private: char pad0[0x1AC]; public:
       float timeScale;//todo: find out what else we can access nearby to add to this struct
};

struct Projectile
{
private: char pad0[0x58]; public:
    bool bounceOffWalls;
private: char pad1[0xF]; public:
    Weapon* weapon;
    int indexInWeapon;
private: char pad2[0x14]; public:
    GameSessionData* gameSessionData;
private: char pad3[0x10]; public:
    float pauseWallChecksTimer;
    float speed;
    int penetrating;
    int bounces;
    bool isCullable;
    bool bounceActivated;
};
//constexpr int hovertrick = offsetof(Projectile, pauseWallChecksTimer);
static_assert(offsetof(Projectile, weapon) == 0x68);
static_assert(offsetof(Projectile, gameSessionData) == 0x88);
static_assert(offsetof(Projectile, pauseWallChecksTimer) == 0xA0);

struct WeaponData
{
    Il2CppObjectBase obj;
    bool hidden;
    bool alwaysHidden;
private: char pad_0012[0x2]; public:
    int level;
    WeaponType bulletType;
private: char pad_001C[0x4]; public:
    Il2CppString* name;
    Il2CppString* description;
    Il2CppString* tips;
    Il2CppString* texture;
    Il2CppString* frameName;
    Il2CppString* collectionFrame;
    Il2CppString* evoInto;
private: char pad_6666[0x8]; public:
    bool isEvolution;
    bool isSpecialOnly;
private: char pad_0062[0x6]; public:
    Il2CppList<WeaponType>* evolvesFrom;
    Il2CppList<WeaponType>* _requires;
    Il2CppList<WeaponType>* requiresMax;
    Il2CppList<WeaponType>* evolutionLine;
    bool isUnlocked;
private: char pad_0089[0x3]; public:
    Nullable<float> volume;
    Nullable<int> poolLimit;
    int rarity;
    float interval;
    Nullable<float> duration;
    float repeatInterval;
    float power;
    float secondaryPower;
    Nullable<float> knockback;
    Nullable<float> hitBoxDelay;
    float area;
    float speed;
    int amount;
    float critChance;
    bool hitsWalls;
private: char pad_00D9[0x3]; public:
    float critMul;
    bool seen;
private: char pad_00E1[0x3]; public:
    Nullable<WeaponType> addEvolvedWeapon;
    Nullable<WeaponType> addNormalWeapon;
    Nullable<WeaponType> excludeWeapon;
    int charges;
    bool intervalDependsOnDuration;
    bool isPowerUp;
private: char pad_0102[0x2]; public:
    int penetrating;
    HitVfxType hitVFX;
private: char pad_010C[0x4]; public:
    Il2CppList<WeaponType>* forcedSynergyWeapons;
    bool skipRemovingBaseWeapon;
    bool hasUniqueRequirements;
private: char pad_011A[0x2]; public:
    float cooldown;
    float maxHp;
    float moveSpeed;
    float growth;
    float magnet;
    float luck;
    float armor;
    float greed;
    float regen;
    float revivals;
    float rerolls;
    float skips;
    float chance;
    Il2CppString* bgm;
    Nullable<float> shieldInvulTime;
    float curse;
private: char pad_0164[0x4]; public:
    Il2CppString* desc;
    float charm;
    float fever;
    float invulTimeBonus;
    Nullable<float> customDesc;
private: char pad_0184[0x4]; public:
    Il2CppString* customDescValue;
    bool unexcludeSelf;
    bool dropRateAffectedByLuck;
    bool sealable;
private: char pad_0193[0x1]; public:
    Nullable<float> price;
    bool appliesOnlyToOwner;
    bool allowDuplicates;
    bool despawnOnUnavailable;
private: char pad_019F[0x1]; public:
    ContentGroupType contentGroup;
    CharacterType followerType;
    AIType followerAI;
};
//constexpr int hovertrick = offsetof(WeaponData, hidden);
static_assert(offsetof(WeaponData, hidden) == 0x10);
static_assert(offsetof(WeaponData, level) == 0x14);
static_assert(offsetof(WeaponData, name) == 0x20);
static_assert(offsetof(WeaponData, isUnlocked) == 0x88);
static_assert(offsetof(WeaponData, volume) == 0x8C);
static_assert(offsetof(WeaponData, poolLimit) == 0x94);
static_assert(offsetof(WeaponData, rarity) == 0x9C);
static_assert(offsetof(WeaponData, desc) == 0x168);
static_assert(offsetof(WeaponData, followerAI) == 0x1A8);

struct LimitBreakData
{
    Il2CppObjectBase obj;
    int rarity;
    Nullable<float> power;
    Nullable<float> area;
    Nullable<float> speed;
    Nullable<int> max;
    Nullable<int> penetrating;
    Nullable<int> amount;
    Nullable<float> chance;
    Nullable<int> duration;
    Nullable<float> critChance;
    Nullable<float> cooldown;
    Nullable<WeaponType> addEvolvedWeapon;
};

struct Weapon
{
private: char pad0[0x68]; public:
    Projectile* projectile;
    GameManager* gameMan;
    PlayerOptions* playerOptions;
    GameSessionData* gameSessionData;
    WeaponData* currentWeaponData;
